# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumericRevisionSettings..::..IsValid Method
NumericRevisionSettings Class See Also
---
Determines whether the NumericRevisionSettings object is in a valid state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the NumericRevisionSettings is valid.
# Remarks
The NumericRevisionSettings should at least contain a non-negative start number.
# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace